modm-ext/archive-stmicro-svd/header_stm32h745bgt6@m7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG1</name>
      <baseAddress>0x50003000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>W</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPV</name>
      <baseAddress>0x51000000</baseAddress>
      <registers>
        <register>
          <name>AXI_PERIPH_ID_4</name>
          <addressOffset>0x1fd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_5</name>
          <addressOffset>0x1fd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_6</name>
          <addressOffset>0x1fd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_7</name>
          <addressOffset>0x1fdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_0</name>
          <addressOffset>0x1fe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_1</name>
          <addressOffset>0x1fe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_2</name>
          <addressOffset>0x1fe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_PERIPH_ID_3</name>
          <addressOffset>0x1fec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_0</name>
          <addressOffset>0x1ff0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_1</name>
          <addressOffset>0x1ff4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_2</name>
          <addressOffset>0x1ff8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_COMP_ID_3</name>
          <addressOffset>0x1ffc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_ISS_BM</name>
          <addressOffset>0x2008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD2</name>
          <addressOffset>0x2024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_LB</name>
          <addressOffset>0x202c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD</name>
          <addressOffset>0x2108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_ISS_BM</name>
          <addressOffset>0x3008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD2</name>
          <addressOffset>0x3024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_LB</name>
          <addressOffset>0x302c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD</name>
          <addressOffset>0x3108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG3_FN_MOD_ISS_BM</name>
          <addressOffset>0x4008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG4_FN_MOD_ISS_BM</name>
          <addressOffset>0x5008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG5_FN_MOD_ISS_BM</name>
          <addressOffset>0x6008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG6_FN_MOD_ISS_BM</name>
          <addressOffset>0x7008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_ISS_BM</name>
          <addressOffset>0x8008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD2</name>
          <addressOffset>0x8024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_LB</name>
          <addressOffset>0x802c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD</name>
          <addressOffset>0x8108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD2</name>
          <addressOffset>0x42024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD_AHB</name>
          <addressOffset>0x42028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_READ_QOS</name>
          <addressOffset>0x42100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_WRITE_QOS</name>
          <addressOffset>0x42104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD</name>
          <addressOffset>0x42108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_READ_QOS</name>
          <addressOffset>0x43100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_WRITE_QOS</name>
          <addressOffset>0x43104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI2_FN_MOD</name>
          <addressOffset>0x43108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD2</name>
          <addressOffset>0x44024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD_AHB</name>
          <addressOffset>0x44028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_READ_QOS</name>
          <addressOffset>0x44100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_WRITE_QOS</name>
          <addressOffset>0x44104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD</name>
          <addressOffset>0x44108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_READ_QOS</name>
          <addressOffset>0x45100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_WRITE_QOS</name>
          <addressOffset>0x45104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI4_FN_MOD</name>
          <addressOffset>0x45108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_READ_QOS</name>
          <addressOffset>0x46100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_WRITE_QOS</name>
          <addressOffset>0x46104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI5_FN_MOD</name>
          <addressOffset>0x46108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_READ_QOS</name>
          <addressOffset>0x47100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_WRITE_QOS</name>
          <addressOffset>0x47104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI6_FN_MOD</name>
          <addressOffset>0x47108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_READ_QOS</name>
          <addressOffset>0x48100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_WRITE_QOS</name>
          <addressOffset>0x48104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AXI_INI7_FN_MOD</name>
          <addressOffset>0x48108</addressOffset>
          <size>0x20</size>
        </register>
